import Head from 'next/head';

const PrivacyPolicyPage = () => {
  return (
    <>
      <Head>
        <title>นโยบายความเป็นส่วนตัว PropKub.com</title>
        <meta
          name="description"
          content="นโยบายความเป็นส่วนตัวของเว็บไซต์ PropKub.com อธิบายถึงข้อมูลส่วนบุคคลของผู้ใช้งานที่เราเก็บรวบรวม แหล่งที่มาของข้อมูล วัตถุประสงค์ในการประมวลผลข้อมูล รวมถึงระยะเวลาในการจัดเก็บรักษาข้อมูลส่วนบุคคล นอกจากนี้ยังอธิบายถึงสิทธิ์ต่างๆของเจ้าของข้อมูลที่สามารถร้องขอให้ทีมงานช่วยดำเนินการให้"
        />
      </Head>
      <div className="relative overflow-hidden bg-white py-16">
        <div className="hidden lg:absolute lg:inset-y-0 lg:block lg:h-full lg:w-full lg:[overflow-anchor:none]">
          <div
            className="relative mx-auto h-full max-w-prose text-lg"
            aria-hidden="true"
          >
            <svg
              className="absolute top-12 left-full translate-x-32 transform"
              width={404}
              height={384}
              fill="none"
              viewBox="0 0 404 384"
            >
              <defs>
                <pattern
                  id="74b3fd99-0a6f-4271-bef2-e80eeafdf357"
                  x={0}
                  y={0}
                  width={20}
                  height={20}
                  patternUnits="userSpaceOnUse"
                >
                  <rect
                    x={0}
                    y={0}
                    width={4}
                    height={4}
                    className="text-gray-200"
                    fill="currentColor"
                  />
                </pattern>
              </defs>
              <rect
                width={404}
                height={384}
                fill="url(#74b3fd99-0a6f-4271-bef2-e80eeafdf357)"
              />
            </svg>
            <svg
              className="absolute top-1/2 right-full -translate-y-1/2 -translate-x-32 transform"
              width={404}
              height={384}
              fill="none"
              viewBox="0 0 404 384"
            >
              <defs>
                <pattern
                  id="f210dbf6-a58d-4871-961e-36d5016a0f49"
                  x={0}
                  y={0}
                  width={20}
                  height={20}
                  patternUnits="userSpaceOnUse"
                >
                  <rect
                    x={0}
                    y={0}
                    width={4}
                    height={4}
                    className="text-gray-200"
                    fill="currentColor"
                  />
                </pattern>
              </defs>
              <rect
                width={404}
                height={384}
                fill="url(#f210dbf6-a58d-4871-961e-36d5016a0f49)"
              />
            </svg>
            <svg
              className="absolute bottom-12 left-full translate-x-32 transform"
              width={404}
              height={384}
              fill="none"
              viewBox="0 0 404 384"
            >
              <defs>
                <pattern
                  id="d3eb07ae-5182-43e6-857d-35c643af9034"
                  x={0}
                  y={0}
                  width={20}
                  height={20}
                  patternUnits="userSpaceOnUse"
                >
                  <rect
                    x={0}
                    y={0}
                    width={4}
                    height={4}
                    className="text-gray-200"
                    fill="currentColor"
                  />
                </pattern>
              </defs>
              <rect
                width={404}
                height={384}
                fill="url(#d3eb07ae-5182-43e6-857d-35c643af9034)"
              />
            </svg>
          </div>
        </div>
        <div className="relative px-6 lg:px-8">
          <div className="mx-auto max-w-prose text-lg">
            <h1>
              <span className="mt-2 mb-20 block text-center text-3xl font-bold leading-8 tracking-tight text-gray-900 sm:text-4xl">
                นโยบายความเป็นส่วนตัว
              </span>
            </h1>
          </div>
          <div className="prose prose-lg prose-indigo mx-auto mt-6 text-gray-500">
            <h2>ข้อมูลส่วนบุคคล คืออะไร?</h2>
            <p>
              ข้อมูลส่วนบุคคล หมายถึง
              ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้
              ไม่ว่าทางตรงหรือทางอ้อม แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรมโดยเฉพาะ
            </p>

            <h2>ข้อมูลส่วนบุคคลที่เราเก็บรวบรวม</h2>
            <p>เราจะเก็บรวบรวมข้อมูลส่วนบุคคลดังต่อไปนี้</p>
            <ol>
              <li>
                ข้อมูลการเข้าถึงเว็บไซต์ของท่าน โดยระบบ Analytics เช่น
                <a
                  href="https://analytics.google.com/analytics/academy/"
                  className="mx-1"
                >
                  Google Analytics
                </a>
              </li>
              <li>
                ข้อมูลอีเมลของท่าน หากท่านลือกลงทะเบียนรับข่าวสารจาก PropKub
              </li>
            </ol>

            <h2>แหล่งที่มาของข้อมูลส่วนบุคคล</h2>
            <p>
              เราได้รับข้อมูลส่วนบุคคลจากท่านโดยตรง
              โดยเราจะเก็บรวบรวมข้อมูลส่วนบุคคลของท่านจากขั้นตอนการให้บริการ
              ดังนี้
            </p>
            <ol>
              <li>
                จากความสมัครใจของท่าน ในการโต้ตอบทาง email
                หรือช่องทางการสื่อสารอื่นๆ ระหว่างเราและท่าน
              </li>
              <li>จากข้อมูลการใช้งานบน website propkub.com ของท่าน</li>
            </ol>

            <h2>วัตถุประสงค์ในการประมวลผลข้อมูล</h2>
            <ol>
              <li>
                เราจัดเก็บข้อมูลส่วนบุคคลของท่านเพื่อนำข้อมูลการใช้งานมาวิเคราะห์
                ในการปรับปรุงเว็บไซต์ให้ดีขึ้น
              </li>
              <li>
                เราจัดเก็บข้อมูลส่วนบุคคลของท่านเพื่อติดต่อแจ้งข่าวสารและโปรโมชั่นต่างๆ
                ตามที่ท่านได้ให้ไว้เรา
              </li>
            </ol>

            <h2>การประมวลผลข้อมูลส่วนบุคคล</h2>
            <p>
              เมื่อได้รับข้อมูลส่วนบุคคลจากแหล่งที่มาของข้อมูลส่วนบุคคลแล้ว
              เราจะดำเนินการดังนี้กับข้อมูลส่วนบุคคลของท่าน
            </p>
            <ol>
              <li>เก็บรวมรวมผ่านแบบฟอร์ม และโค้ดบนเว็บไซต์</li>
              <li>
                ใช้ข้อมูลเพื่อวิเคราะห์การเข้าใช้งาน เพื่อพัฒนา Content
                บนเว็บไซต์ในอนาคต
              </li>
              <li>เปิดเผยให้กับระบบส่งข้อมูลข่าวสารที่ทำงานอัตโนมัติ</li>
            </ol>

            <h2>การเก็บรักษาและระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล</h2>
            <h3>การเก็บรักษาข้อมูลส่วนบุคคล</h3>
            <p>ผู้ควบคุมทำการเก็บรักษาข้อมูลส่วนบุคคลของท่าน ดังนี้</p>
            <ol>
              <li>ลักษณะการเก็บข้อมูลแบบ Soft Copy</li>
              <li>
                สถานที่จัดเก็บ บนระบบออนไลน์ของ PropKub และบนบริการต่าง ๆ
                ตามที่ท่านลงทะเบียนไว้
              </li>
              <li>
                ระยะเวลาจัดเก็บ เป็นไปตามหัวข้อ
                ระยะเวลาในการประมวลผลข้อมูลส่วนบุคคล
              </li>
              <li>
                เมื่อพ้นระยะเวลาจัดเก็บข้อมูล
                ทางเราจะไม่มีสิทธิ์ในการประมวลผลข้อมูลส่วนบุคคลของท่านแล้ว
                โดยเราจะดำเนินการทำลายข้อมูลส่วนบุคคลนั้นด้วยวิธีการทำลาย Soft
                Copy และจะดำเนินการให้แล้วเสร็จภายใน 90
                วันนับแต่วันสิ้นสุดระยะเวลาดังกล่าว
              </li>
            </ol>

            <h3>ระยะเวลาการเก็บรักษาข้อมูลส่วนบุคคล</h3>
            <p>
              เรามีการจัดเก็บข้อมูลส่วนบุคคลและข้อมูลที่บ่งชี้ตัวตนของท่าน อาทิ
              ชื่อ ที่อยู่ สถานที่ติดต่อ เบอร์โทร อีเมล ไอพีแอดเดรส
              โดยทางเราจะจัดเก็บข้อมูลเหล่านี้ไว้ในระบบจนกว่าท่านจะแจ้งให้ลบ
              หรือไม่เกิน 20 ปี
            </p>

            <h2>สิทธิ์ของเจ้าของข้อมูล</h2>
            <p>ท่านมีสิทธิ์ในการดำเนินการ ดังต่อไปนี้</p>
            <ol>
              <li>
                สิทธิ์ในการเพิกถอนความยินยอม (right to withdraw consent):
                ท่านมีสิทธิ์ในการเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคลที่ท่านได้ให้ความยินยอมกับเราได้ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านอยู่กับเรา
              </li>
              <li>
                สิทธิ์ในการเข้าถึงข้อมูลส่วนบุคคล (right of access):
                ท่านมีสิทธิ์ในการเข้าถึงข้อมูลส่วนบุคคลของท่านและขอให้เราทำสำเนาข้อมูลส่วนบุคคลดังกล่าวให้แก่ท่าน
                รวมถึงขอให้เราเปิดเผยการได้มาซึ่งข้อมูลส่วนบุคคลที่ท่านไม่ได้ให้ความยินยอมต่อเราได้
              </li>

              <li>
                สิทธิ์ในการแก้ไขข้อมูลส่วนบุคคลให้ถูกต้อง (right to
                rectification):
                ท่านมีสิทธิ์ในการขอให้เราแก้ไขข้อมูลที่ไม่ถูกต้อง หรือ
                เพิ่มเติมข้อมูลที่ไม่สมบูรณ์
              </li>

              <li>
                สิทธิ์ในการลบข้อมูลส่วนบุคคล (right to erasure):
                ท่านมีสิทธิ์ในการขอให้เราทำการลบข้อมูลของท่านด้วยเหตุบาง
                ประการได้
              </li>

              <li>
                สิทธิ์ในการระงับการใช้ข้อมูลส่วนบุคคล (right to restriction of
                processing):
                ท่านมีสิทธิ์ในการระงับการใช้ข้อมูลส่วนบุคคลของท่านด้วยเหตุบางประการได้
              </li>

              <li>
                สิทธิ์ในการให้โอนย้ายข้อมูลส่วนบุคคล (right to data
                portability):
                ท่านมีสิทธิ์ในการโอนย้ายข้อมูลส่วนบุคคลของท่านที่ท่านให้ไว้กับเราไปยังผู้ควบคุมข้อมูลรายอื่น
                หรือตัวท่านเองด้วยเหตุบางประการได้
              </li>

              <li>
                สิทธิ์ในการคัดค้านการประมวลผลข้อมูลส่วนบุคคล (right to object):
                ท่านมีสิทธิ์ในการคัดค้านการประมวลผลข้อมูลส่วนบุคคลของท่านด้วยเหตุบางประการได้
              </li>
            </ol>
            <p>
              ท่านสามารถติดต่อมายังเจ้าหน้าที่ DPO ของเรา
              เพื่อดำเนินการยื่นคำร้องขอดำเนินการตามสิทธิ์ข้างต้นได้
              (รายละเอียดการติดต่อปรากฏในหัวข้อ “ช่องทางการติดต่อ” ด้านล่างนี้)
              หรือท่านสามารถศึกษา รายละเอียดเงื่อนไข ขอยกเว้นการใช้สิทธิ์ต่างๆ
              ได้เพิ่มเติมที่
              <a href="https://www.mdes.go.th" className="mx-1">
                เว็บไซต์กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม
                https://www.mdes.go.th
              </a>
            </p>
            <p>
              ทั้งนี้ ท่านไม่จำเป็นต้องเสียค่าใช้จ่ายใดๆ
              ในการดำเนินตามสิทธิ์ข้างต้น
              โดยเราจะพิจารณาและแจ้งผลการพิจารณาตามคำร้องของท่านภายใน 30
              วันนับแต่วันที่เราได้รับคำร้องขอดังกล่าว
            </p>

            <h2>กิจกรรมทางการตลาดและการส่งเสริมการตลาด</h2>
            <p>
              ในระหว่างการใช้บริการ
              เราจะส่งข้อมูลข่าวสารเกี่ยวกับกิจกรรมทางการตลาดและการส่งเสริมการตลาด
              ผลิตภัณฑ์ การให้บริการของเราที่ท่านอาจสนใจ
              เพื่อประโยชน์ในการให้บริการกับท่านอย่างเต็มประสิทธิภาพ
              หากท่านได้ตกลงที่จะรับข้อมูลข่าวสารดังกล่าวจากเราแล้ว
              ท่านมีสิทธิ์ยกเลิกความยินยอมดังกล่าวได้ทุกเมื่อ
              โดยท่านสามารถดำเนินการยกเลิกความยินยอมในการรับแจ้งข้อมูลข่าวสารได้ตามขั้นตอนดังนี้
            </p>
            <ol>
              <li>
                กดที่ลิงค์ใต้อีเมลต่างๆที่ท่านได้รับจากเรา เพื่อ unsubscribe
                (หยุดการรับข่าวสาร) จากเราได้ทุกเมื่อ
              </li>
              <li>
                ส่งอีเมลมาที่ pdpa@propkub.com
                เพื่อให้เจ้าหน้าที่ของเราถอดถอนท่านออกจากการรับแจ้งอีเมลข่าวสารและโปรโมชั่น
              </li>
            </ol>

            {/* kk */}
            <h2>Cookies</h2>
            <h3>Cookies คืออะไร?</h3>
            <p>
              Cookies
              คือไฟล์ขนาดเล็กที่อยู่ในคอมพิวเตอร์ของท่านที่ใช้เพื่อจัดเก็บรายละเอียดข้อมูล
              log การใช้งาน internet หรือพฤติกรรมการเยี่ยมชม website ของท่าน
              ท่านสามารถศึกษารายละเอียดเพิ่มเติมของ Cookies ได้จาก
              <a href="https://www.allaboutcookies.org/" className="mx-1">
                https://www.allaboutcookies.org/
              </a>
            </p>

            <h3>เราใช้ Cookies อย่างไร?</h3>
            <p>
              เราจะจัดเก็บข้อมูลการเข้าเยี่ยมชม website จากผู้เข้าเยี่ยมชมทุกราย
              ผ่าน Cookies หรือ เทคโนโลยีที่ใกล้เคียง
              เพื่อศึกษาพฤติกรรมการใช้งานของท่านขณะใช้งานเว็บไซต์ของเรา
              และเพื่อนำไปพัฒนาเว็บไซต์และบริการของเราให้สามารถใช้งานได้ง่ายขึ้น
              รวดเร็ว และมีประสิทธิภาพยิ่งขึ้น
            </p>

            <h3>ประเภทของ Cookies ที่เราใช้</h3>
            <p>
              เราใช้ Cookies ประเภท Analytics Cookies สำหรับเก็บข้อมูล Traffic
              ของเว็บไซต์
            </p>

            <h3>การจัดการ Cookies</h3>
            <p>
              ท่านสามารถตั้งค่ามิให้ browser ของท่าน ตกลงรับ Cookies ของเราได้
            </p>

            <h2>นโยบายคุ้มครองข้อมูลส่วนบุคคลของ website อื่น</h2>
            <p>
              นโยบายความเป็นส่วนตัวฉบับนี้
              ใช้เฉพาะสำหรับการให้บริการของเราและการใช้งาน website
              ของเราเท่านั้น หากท่าน ได้กด link ไปยัง website อื่น
              (แม้จะผ่านช่องทางใน website ของเราก็ตาม)
              ท่านจะต้องศึกษาและปฏิบัติตามนโยบายความเป็นส่วนตัวที่ปรากฏใน
              website นั้นๆ แยกต่างหากจากของเรา
            </p>

            <h2>การเปลี่ยนแปลงนโยบายคุ้มครองข้อมูลส่วนบุคคล</h2>
            <p>
              เราจะทำการพิจารณาทบทวนนโยบายความเป็นส่วนตัวเป็นประจำเพื่อให้สอดคลองกับแนวปฏิบัติและ
              กฎหมาย ข้อบังคับที่เกี่ยวของ
              ทั้งนี้หากมีการเปลี่ยนแปลงนโยบายความเป็นส่วนตัว
              เราจะแจ้งให้ท่านทราบด้วยการ update ข้อมูลลงใน website
              ของเราโดยเร็วที่สุด
            </p>

            <p>
              ปัจจุบัน นโยบายความเป็นส่วนตัวบนเว็บไซต์ของเรา
              ได้รับการทบทวนครั้งล่าสุดเมื่อวันที่ 31 พฤษภาคม 2564
            </p>

            <h2>ช่องทางการติดต่อ</h2>
            <p>รายละเอียดผู้ควบคุมข้อมูล</p>
            <p>
              ชื่อ: DPO (Data Protection Officer) – PropKub<br></br>
              เว็บไซต์: https://propkub.com<br></br>อีเมล: pdpa@propkub.com
            </p>
          </div>
        </div>
      </div>
    </>
  );
};

export default PrivacyPolicyPage;
