{
  "sections": {
    "media": {
      "title": "รูปภาพ",
      "description": "คุณสามารถอัพโหลดรูปภาพได้จำนวน {{min}}-{{max}} รูปต่อ 1 ประกาศ"
    },
    "location": {
      "title": "ตำแหน่งที่ตั้งทรัพย์",
      "map": {
        "searchLabel": "พิมพ์คำค้นหาเพื่อปักหมุดอัตโนมัติ",
        "searchPlaceholder": "ค้นหาด้วยชื่อโครงการเช่น คอนโดไอดีโอ โมบิ สุขุมวิท อีสท์เกต (หรืออ่านคำแนะนำการปักแผนที่ด้านล่าง)",
        "searchButton": "ค้นหา",
        "quotaRemaining": "โควต้าการค้นหาบนแผนที่เหลือ",
        "quotaNote": "ครั้ง **เราจำกัดจำนวนครั้งการค้นหาเนื่องจาก Google Map มีค่าบริการสูง",
        "guideToggle": "อ่านคำแนะนำการปักแผนที่",
        "guideTitle": "ตัวอย่างคำค้นหาที่ช่วยให้เจอที่ตั้งของทรัพย์ได้ง่ายขึ้น โดยให้ลองตามลำดับ",
        "guideExample1Note": "(ชื่อโครงการเต็มภาษาไทย)",
        "guideExample2Note": "(ชื่อโครงการเต็มภาษาอังกฤษ)",
        "guideExample3": "3. คอนโดไอดีโอ โมบิ สุขุมวิท อีสท์เกต ถนนสุขุมวิท",
        "guideExample3Note": "(ชื่อโครงการ + ถนน/ซอย)",
        "guideExample4": "4. คอนโดไอดีโอ โมบิ สุขุมวิท อีสท์เกต บางนา",
        "guideExample4Note": "(ชื่อโครงการ + เขต/อำเภอ)",
        "guideExample5": "5. หากคุณค้นหาแล้ว 4 ครั้งยังไม่เจอ ครั้งสุดท้ายให้คุณค้นหาสถานที่สำคัญที่ใกล้เคียงที่สุด เช่นสี่แยกบางนา หลังจากนั้นให้เลื่อนแผนที่เพื่อปักหมุดเอง",
        "modal": {
          "title": "การปักหมุด",
          "description": "เริ่มต้นปักหมุดโดยพิมพ์ชื่อโครงการ/สถานที่บนช่องค้นหาด้านบน"
        },
        "infoWindow": {
          "waiting": "รอปักหมุดที่ตั้งทรัพย์",
          "pinned": "พิกัด {{lat}},{{lng}} (ปักหมุดแล้ว)",
          "instructions": "คลิกบนแผนที่หรือลากหมุดสีแดงหากต้องการเปลี่ยนจุดปักหมุด"
        }
      }
    },
    "confirm": {
      "title": "ยืนยันข้อมูล"
    }
  },
  "fields": {
    "price": {
      "unitPrefix": "/"
    },
    "desc": {
      "info": "อธิบายรายละเอียดของทรัพย์ให้ครบถ้วนสมบูรณ์ ประกาศที่มีคุณภาพจะต้องมีความยาวของรายละเอียดระหว่าง 200-4000 ตัวอักษร โปรดทราบว่าการแปะลิ้งค์ที่ไม่เหมาะหรือลิ้งค์สแปมลงในประกาศเป็นการผิดกฎการใช้งาน เมื่อถูกตรวจพบบัญชีของคุณจะถูกแบนถาวรโดยไม่แจ้งให้ทราบล่วงหน้า ลิงค์ที่ไม่ผิดกฎได้แก่ ลิงค์ไปยังเว็บไซต์ของคุณหรือบริษัทที่คุณสังกัด ลิงค์เฟจบุ๊คแฟนเพจ ลิ้งค์บัญชีไลน์ หรือโซเซียลมีเดียต่างๆของคุณ เป็นต้น โดยคุณสามารถเพิ่มลิงค์ได้โดยไฮไลต์ข้อความที่ต้องการและคลิกที่ไอคอนห่วงโซ่ด้านบนเพื่อเพิ่มลิงค์"
    },
    "refId": {
      "label": "หมายเลขอ้างอิง (ถ้ามี)",
      "placeholder": "หมายเลขอ้างอิงภายในของ Agent เอง"
    },
    "images": {
      "label": "รูปภาพ",
      "validation": {
        "required": "กรุณาอัพโหลดภาพของประกาศจำนวน {{min}}-{{max}} ภาพ",
        "count": "กรุณาอัพโหลดภาพของประกาศจำนวน {{min}}-{{max}} ภาพ"
      }
    },
    "accept": {
      "label": "ขอยืนยันว่าฉันเป็นเจ้าของหรือเป็นตัวแทนที่ได้รับอนุญาตแล้ว ในการลงภาพและข้อมูลทุกอย่างที่ได้ระบุไว้ในประกาศนี้ หากเกิดข้อพิพาทใดๆ เกี่ยวกับประกาศนี้ในอนาคต ฉันยินดีรับผิดชอบทั้งหมด"
    },
    "address": {
      "regionId": {
        "label": "ภูมิภาค"
      },
      "provinceId": {
        "label": "จังหวัด"
      },
      "districtId": {
        "label": "เขต/อำเภอ"
      },
      "subDistrictId": {
        "label": "แขวง/ตำบล"
      }
    }
  }
}
